#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/pomelo-challenge/pomelo-challenge-gh-actions/runs/run-exajcTyUHr7FT5sa

Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg]
random_id.randomId: Refreshing state... [id=iMDPQcfGLjA]
azurerm_route_table.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/routeTables/terraform-route-table]
azurerm_public_ip.nat: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/publicIPAddresses/terraform-nat-gateway-public-ip]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkSecurityGroups/terraform-nsg]
azurerm_public_ip.web: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/publicIPAddresses/terraform-public-ip]
azurerm_virtual_network.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/virtualNetworks/terraform-network]
azurerm_public_ip_prefix.nat: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/publicIPPrefixes/terraform-nat-gateway-public-ip-prefix]
azurerm_postgresql_server.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.DBforPostgreSQL/servers/postgresql-88c0cf41c7c62e30]
azurerm_storage_account.storageaccount_log: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Storage/storageAccounts/log88c0cf41c7c62e30]
azurerm_log_analytics_workspace.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.OperationalInsights/workspaces/terraform-log-analytics-88c0cf41c7c62e30]
azurerm_subnet.web: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/virtualNetworks/terraform-network/subnets/terraform-web-subnet]
azurerm_subnet.default: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/virtualNetworks/terraform-network/subnets/default]
azurerm_postgresql_firewall_rule.home: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.DBforPostgreSQL/servers/postgresql-88c0cf41c7c62e30/firewallRules/home]
azurerm_postgresql_database.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.DBforPostgreSQL/servers/postgresql-88c0cf41c7c62e30/databases/generaldb]
azurerm_network_security_rule.http_rule: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkSecurityGroups/terraform-nsg/securityRules/http]
azurerm_network_security_rule.web_rule: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkSecurityGroups/terraform-nsg/securityRules/web]
azurerm_network_security_rule.ssh_rule: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkSecurityGroups/terraform-nsg/securityRules/ssh]
azurerm_network_security_rule.https_rule: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkSecurityGroups/terraform-nsg/securityRules/https]
azurerm_subnet_route_table_association.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/virtualNetworks/terraform-network/subnets/terraform-web-subnet]
azurerm_nat_gateway.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/natGateways/terraform-nat-gatway]
azurerm_network_interface.nic: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkInterfaces/terraform-nic]
azurerm_nat_gateway_public_ip_association.main: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/natGateways/terraform-nat-gatway|/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/publicIPAddresses/terraform-nat-gateway-public-ip]
azurerm_subnet_nat_gateway_association.web: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/virtualNetworks/terraform-network/subnets/terraform-web-subnet]
azurerm_network_interface_security_group_association.nsg_attach: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkInterfaces/terraform-nic|/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Network/networkSecurityGroups/terraform-nsg]
azurerm_linux_virtual_machine.web: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Compute/virtualMachines/terraform-vm]
azurerm_virtual_machine_extension.web: Refreshing state... [id=/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.Compute/virtualMachines/terraform-vm/extensions/OmsAgentForLinux]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_postgresql_server.main will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_postgresql_server" "main"  {
      ~ administrator_login = "pqsqladmin" -> (known after apply)
      ~ fqdn                = "postgresql-88c0cf41c7c62e30.postgres.database.azure.com" -> (known after apply)
      ~ id                  = "/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.DBforPostgreSQL/servers/postgresql-88c0cf41c7c62e30" -> (known after apply)
      ~ identity            = [] -> (known after apply)
      ~ location            = "southeastasia" -> (known after apply)
        name                = "postgresql-88c0cf41c7c62e30"
      ~ sku_name            = "B_Gen5_1" -> (known after apply)
      ~ tags                = {} -> (known after apply)
      ~ version             = "11" -> (known after apply)
        # (1 unchanged attribute hidden)

      + timeouts {
          + read = (known after apply)
        }
    }

  # azurerm_postgresql_database.main will be created
  + resource "azurerm_postgresql_database" "main" {
      + charset             = "UTF8"
      + collation           = "English_United States.1252"
      + id                  = (known after apply)
      + name                = "generaldb"
      + resource_group_name = "terraform-rg"
      + server_name         = "postgresql-88c0cf41c7c62e30"
    }

  # azurerm_postgresql_firewall_rule.home will be created
  + resource "azurerm_postgresql_firewall_rule" "home" {
      + end_ip_address      = "255.255.255.255"
      + id                  = (known after apply)
      + name                = "home"
      + resource_group_name = "terraform-rg"
      + server_name         = "postgresql-88c0cf41c7c62e30"
      + start_ip_address    = "0.0.0.0"
    }

  # azurerm_postgresql_server.main will be created
  + resource "azurerm_postgresql_server" "main" {
      + administrator_login              = "pqsqladmin"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 7
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = false
      + id                               = (known after apply)
      + location                         = "southeastasia"
      + name                             = "postgresql-88c0cf41c7c62e30"
      + public_network_access_enabled    = true
      + resource_group_name              = "terraform-rg"
      + sku_name                         = "B_Gen5_1"
      + ssl_enforcement                  = (known after apply)
      + ssl_enforcement_enabled          = true
      + ssl_minimal_tls_version_enforced = "TLSEnforcementDisabled"
      + storage_mb                       = 51200
      + version                          = "11"

      + storage_profile {
          + auto_grow             = (known after apply)
          + backup_retention_days = (known after apply)
          + geo_redundant_backup  = (known after apply)
          + storage_mb            = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - postgresql_server_id = "/subscriptions/d3db30d5-e9e2-4560-9118-1db3a81f0423/resourceGroups/terraform-rg/providers/Microsoft.DBforPostgreSQL/servers/postgresql-88c0cf41c7c62e30" -> null
```

</details>

*Pusher: @knotvich, Action: `pull_request`*